УправлениеВетеринарнойКлиникой/src/Documents/СписаниеСРассчетногоСчета/СписаниеСРассчетногоСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеСРассчетногоСчета</name>
  <basedOn>Document.ЗакупкаТоваров</basedOn>
  <registerRecords>AccumulationRegister.АвансыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПередПоставщиками</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Поставщики</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

УправлениеВетеринарнойКлиникой/src/AccumulationRegisters/ЗадолженностьПередПоставщиками/ЗадолженностьПередПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗадолженностьПередПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Поставщики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеВетеринарнойКлиникой/src/AccumulationRegisters/АвансыПоставщикам/АвансыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АвансыПоставщикам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Поставщики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеВетеринарнойКлиникой/src/Documents/СписаниеСРассчетногоСчета/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗакупкаТоваров") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Поставщик;
		Договор = ДанныеЗаполнения.Договор;
		Сумма = ДанныеЗаполнения.СуммаДокумента;
		Ответственный = ДанныеЗаполнения.Ответственный;

	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)

	СформироватьДвиженияВзаиморасчетыСПоставщиками();
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияВзаиморасчетыСПоставщиками()

	Движения.ЗадолженностьПередПоставщиками.Записывать = Истина;
	Движения.АвансыПоставщикам.Записывать = Истина;
	Движения.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗадолженностьПередПоставщиками");
	ЭлементБлокировки.УстановитьЗначение("Поставщик", Клиент);
	ЭлементБлокировки.УстановитьЗначение("Договор", Договор);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.АвансыПоставщикам");
	ЭлементБлокировки.УстановитьЗначение("Поставщик", Клиент);
	ЭлементБлокировки.УстановитьЗначение("Договор", Договор);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Блокировка.Заблокировать();
	
	Движения.ЗадолженностьПередПоставщиками.Записывать = Истина;
	Движения.АвансыПоставщикам.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадолженностьПередПоставщикамиОстатки.СуммаОстаток КАК Долг
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПередПоставщиками.Остатки(&Период, Поставщик = &Поставщик
		|	И Договор = &Договор) КАК ЗадолженностьПередПоставщикамиОстатки";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Поставщик", Клиент);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Долг = 0;
	
	Если РезультатЗапроса.Следующий() Тогда
		Долг = РезультатЗапроса.Долг;
	КонецЕсли;
	
	Если Сумма <= Долг Тогда
		Движение = Движения.ЗадолженностьПередПоставщиками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Договор = Договор;
		Движение.Поставщик = Клиент;
		Движение.Сумма = Сумма;
	Иначе
		
		Если Долг > 0 Тогда
			
			Движение = Движения.ЗадолженностьПередПоставщиками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Договор = Договор;
			Движение.Поставщик = Клиент;
			Движение.Сумма = Долг;
		КонецЕсли;
		
		ОстатокАванса = Сумма - Долг;
		
		Если ОстатокАванса > 0 Тогда
			
			Движение = Движения.АвансыПоставщикам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Договор = Договор;
			Движение.Поставщик = Клиент;
			Движение.Сумма = ОстатокАванса;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
